[
  {
    "section": 1,
    "title": "Databricks Lakehouse Platform",
    "topics": [
      {
        "topic": "Describe the relationship between the data lakehouse and the data warehouse.",
        "answer": "A data warehouse is a data repository that can be used by data analyst or data scientist. A data lake is a generic location where structured and unstructured data can be stored. A data lakehouse is a combination of the two, where structured data is stored in a data warehouse and unstructured data is stored in a data lake. The data lakehouse allows for the flexibility of a data lake while providing the structure and performance of a data warehouse."
      },
      {
        "topic": "Identify the improvement in data quality in the data lakehouse over the data lake.",
        "answer": "Data quality in the data lakehouse is improved over the data lake by providing a structured environment for data storage and processing. This includes features such as schema enforcement, ACID transactions, and data governance capabilities that ensure data integrity and consistency."
      },
      {
        "topic": "Compare and contrast silver and gold tables, which workloads will use a bronze table as a source, which workloads will use a gold table as a source.",
        "answer": "Bronze tables are typically used for raw, unprocessed data, serving as the initial landing zone for data ingestion. Silver tables are used for cleaned and transformed data, often serving as a source for more complex analytics. Gold tables are used for high-quality, aggregated data that is ready for reporting and business intelligence. Workloads that require raw data will use bronze tables, while workloads that require processed data will use silver or gold tables."
      },
      {
        "topic": "Identify elements of the Databricks Platform Architecture, such as what is located in the data plane versus the control plane and what resides in the customer’s cloud account",
        "answer": "The data plane is where the actual data processing occurs, including compute resources and storage. The control plane is responsible for managing the data processing tasks, including job scheduling, cluster management, and user access control. The customer’s cloud account typically contains the data storage and compute resources used by the Databricks platform."
      },
      {
        "topic": "Differentiate between all-purpose clusters and jobs clusters",
        "answer": ""
      },
      {
        "topic": "Identify how cluster software is versioned using the Databricks Runtime",
        "answer": ""
      },
      {
        "topic": "Identify how clusters can be filtered to view those that are accessible by the user",
        "answer": ""
      },
      {
        "topic": "Describe how clusters are terminated and the impact of terminating a cluster",
        "answer": ""
      },
      {
        "topic": "Identify a scenario in which restarting the cluster will be useful",
        "answer": ""
      },
      {
        "topic": "Describe how to use multiple languages within the same notebook",
        "answer": ""
      },
      {
        "topic": "Identify how to run one notebook from within another notebook",
        "answer": ""
      },
      {
        "topic": "Identify how notebooks can be shared with others",
        "answer": ""
      },
      {
        "topic": "Describe how Databricks Repos enables CI/CD workflows in Databricks",
        "answer": ""
      },
      {
        "topic": "Identify Git operations available via Databricks Repos",
        "answer": ""
      },
      {
        "topic": "Identify limitations in Databricks Notebooks version control functionality relative to Repos.        ",
        "answer": ""
      }
    ]
  },
  {
    "section": 2,
    "title": "ELT with Apache Spark",
    "topics": [
      {
        "topic": "Extract data from a single file and from a directory of files",
        "answer": ""
      },
      {
        "topic": "Identify the prefix included after the FROM keyword as the data type.",
        "answer": ""
      },
      {
        "topic": "Create a view, a temporary view, and a CTE as a reference to a file",
        "answer": ""
      },
      {
        "topic": "Identify that tables from external sources are not Delta Lake tables.",
        "answer": ""
      },
      {
        "topic": "Create a table from a JDBC connection and from an external CSV file",
        "answer": ""
      },
      {
        "topic": "Identify how the count_if function and the count where x is null can be used",
        "answer": ""
      },
      {
        "topic": "Identify how the count(row) skips NULL values.",
        "answer": ""
      },
      {
        "topic": "Deduplicate rows from an existing Delta Lake table.",
        "answer": ""
      },
      {
        "topic": "Create a new table from an existing table while removing duplicate rows.",
        "answer": ""
      },
      { "topic": "Deduplicate a row based on specific columns.", "answer": "" },
      {
        "topic": "Validate that the primary key is unique across all rows.",
        "answer": ""
      },
      {
        "topic": "Validate that a field is associated with just one unique value in another field.",
        "answer": ""
      },
      {
        "topic": "Validate that a value is not present in a specific field.",
        "answer": ""
      },
      { "topic": "Cast a column to a timestamp.", "answer": "" },
      { "topic": "Extract calendar data from a timestamp.", "answer": "" },
      {
        "topic": "Extract a specific pattern from an existing string column.",
        "answer": ""
      },
      {
        "topic": "Utilize the dot syntax to extract nested data fields.",
        "answer": ""
      },
      {
        "topic": "Identify the benefits of using array functions.",
        "answer": ""
      },
      { "topic": "Parse JSON strings into structs.", "answer": "" },
      {
        "topic": "Identify which result will be returned based on a join query.",
        "answer": ""
      },
      {
        "topic": "Identify a scenario to use the explode function versus the flatten function",
        "answer": ""
      },
      {
        "topic": "Identify the PIVOT clause as a way to convert data from a long format to a wide format.",
        "answer": ""
      },
      { "topic": "Define a SQL UDF.", "answer": "" },
      { "topic": "Identify the location of a function.", "answer": "" },
      {
        "topic": "Describe the security model for sharing SQL UDFs.",
        "answer": ""
      },
      { "topic": "Use CASE/WHEN in SQL code.", "answer": "" },
      { "topic": "Leverage CASE/WHEN for custom control flow.", "answer": "" }
    ]
  },
  {
    "section": 3,
    "title": "Incremental Data Processing",
    "topics": [
      {
        "topic": "Identify where Delta Lake provides ACID transactions",
        "answer": ""
      },
      { "topic": "Identify the benefits of ACID transactions.", "answer": "" },
      {
        "topic": "Identify whether a transaction is ACID-compliant.",
        "answer": ""
      },
      { "topic": "Compare and contrast data and metadata.", "answer": "" },
      {
        "topic": "Compare and contrast managed and external tables.",
        "answer": ""
      },
      {
        "topic": "Identify a scenario to use an external table.",
        "answer": ""
      },
      { "topic": "Create a managed table.", "answer": "" },
      { "topic": "Identify the location of a table.", "answer": "" },
      {
        "topic": "Inspect the directory structure of Delta Lake files.",
        "answer": ""
      },
      {
        "topic": "Identify who has written previous versions of a table.",
        "answer": ""
      },
      { "topic": "Review a history of table transactions.", "answer": "" },
      { "topic": "Roll back a table to a previous version.", "answer": "" },
      {
        "topic": "Identify that a table can be rolled back to a previous version.",
        "answer": ""
      },
      { "topic": "Query a specific version of a table.", "answer": "" },
      {
        "topic": "Identify why Zordering is beneficial to Delta Lake tables.",
        "answer": ""
      },
      { "topic": "Identify how vacuum commits deletes.", "answer": "" },
      {
        "topic": "Identify the kind of files Optimize compacts.",
        "answer": ""
      },
      { "topic": "Identify CTAS as a solution.", "answer": "" },
      { "topic": "Create a generated column.", "answer": "" },
      { "topic": "Add a table comment.", "answer": "" },
      {
        "topic": "Use CREATE OR REPLACE TABLE and INSERT OVERWRITE",
        "answer": ""
      },
      {
        "topic": "Compare and contrast CREATE OR REPLACE TABLE and INSERT OVERWRITE",
        "answer": ""
      },
      {
        "topic": "Identify a scenario in which MERGE should be used.",
        "answer": ""
      },
      {
        "topic": "Identify MERGE as a command to deduplicate data upon writing.",
        "answer": ""
      },
      { "topic": "Describe the benefits of the MERGE command.", "answer": "" },
      {
        "topic": "Identify why a COPY INTO statement is not duplicating data in the target table.",
        "answer": ""
      },
      {
        "topic": "Identify a scenario in which COPY INTO should be used.",
        "answer": ""
      },
      { "topic": "Use COPY INTO to insert data.", "answer": "" },
      {
        "topic": "Identify the components necessary to create a new DLT pipeline.",
        "answer": ""
      },
      {
        "topic": "Identify the purpose of the target and of the notebook libraries in creating a pipeline.",
        "answer": ""
      },
      {
        "topic": "Compare and contrast triggered and continuous pipelines in terms of cost and latency",
        "answer": ""
      },
      {
        "topic": "Identify which source location is utilizing Auto Loader.",
        "answer": ""
      },
      {
        "topic": "Identify a scenario in which Auto Loader is beneficial.",
        "answer": ""
      },
      {
        "topic": "Identify why Auto Loader has inferred all data to be STRING from a JSON source",
        "answer": ""
      },
      {
        "topic": "Identify the default behavior of a constraint violation",
        "answer": ""
      },
      {
        "topic": "Identify the impact of ON VIOLATION DROP ROW and ON VIOLATION FAIL UPDATEfor a constraint violation",
        "answer": ""
      },
      {
        "topic": "Explain change data capture and the behavior of APPLY CHANGES INTO",
        "answer": ""
      },
      {
        "topic": "Query the events log to get metrics, perform audit loggin, examine lineage.",
        "answer": ""
      },
      {
        "topic": "Troubleshoot DLT syntax: Identify which notebook in a DLT pipeline produced an error, identify the need for LIVE in create statement, identify the need for STREAM in from clause.",
        "answer": ""
      }
    ]
  },
  {
    "section": 4,
    "title": "Production Pipelines",
    "topics": [
      {
        "topic": "Identify the benefits of using multiple tasks in Jobs.",
        "answer": ""
      },
      { "topic": "Set up a predecessor task in Jobs.", "answer": "" },
      {
        "topic": "Identify a scenario in which a predecessor task should be set up.",
        "answer": ""
      },
      { "topic": "Review a task's execution history.", "answer": "" },
      { "topic": "Identify CRON as a scheduling opportunity.", "answer": "" },
      { "topic": "Debug a failed task.", "answer": "" },
      { "topic": "Set up a retry policy in case of failure.", "answer": "" },
      {
        "topic": "Create an alert in the case of a failed task.",
        "answer": ""
      },
      { "topic": "Identify that an alert can be sent via email.", "answer": "" }
    ]
  },
  {
    "section": 5,
    "title": "Data Governance",
    "topics": [
      {
        "topic": "Identify one of the four areas of data governance.",
        "answer": ""
      },
      {
        "topic": "Compare and contrast metastores and catalogs.",
        "answer": ""
      },
      { "topic": "Identify Unity Catalog securables.", "answer": "" },
      { "topic": "Define a service principal.", "answer": "" },
      {
        "topic": "Identify the cluster security modes compatible with Unity Catalog.",
        "answer": ""
      },
      { "topic": "Create a UC-enabled all-purpose cluster.", "answer": "" },
      { "topic": "Create a DBSQL warehouse.", "answer": "" },
      {
        "topic": "Identify how to query a three-layer namespace.",
        "answer": ""
      },
      { "topic": "Implement data object access control", "answer": "" },
      {
        "topic": "Identify colocating metastores with a workspace as best practice.",
        "answer": ""
      },
      {
        "topic": "Identify using service principals for connections as best practice.",
        "answer": ""
      },
      {
        "topic": "Identify the segregation of business units across catalog as best practice.",
        "answer": ""
      }
    ]
  }
]
